[
        {
                "id": "story",
                "name": "The Prologue",
                "story": "As you may remember from starting the game all those months ago, your chosen Traveler (Aether or Lumine, we'll just go with the Traveler from now on) was locked in battle with a mysterious god-like figure in a world of pillars above the clouds (presumed to be Celestia, though it'll be a while yet before we learn any more about that). The god trapped your sibling in a mess of red cubes and then sent you hurtling to the ground in a new land called Teyvat, where you came across your new emergency food supply/guide Paimon. You also gain the ability to control the element of Anemo (wind) after encountering a statue of one of the Seven Gods of Teyvat. Paimon promises to help you find your sibling, and that's basically the overarching story for the entire game so far. But the pair's first step is to check with the ruling powers in Mondstadt, the nearby city, to see if anyone has seen the Traveler's sibling. So they head to talk to the Knights of Favonius, joined by their outrider Amber, your first party member. The entire chapter in Mondstadt is mostly a tutorial in which you are introduced to combat and your other early party members; Kaeya, cavalry captain of the Knights of Favonius, and Lisa the librarian. They explain that a couple of things are threatening the peace of Mondstadt right now: a rampaging dragon known as Stormterror and a mysterious dark cult called The Abyss Order. Also some spies from the Northern region of Snezhnaya, called the Fatui, seem to be hanging around town a bit more.",
                "videos": [
                        "//www.youtube.com/embed/TAlKhARUcoY",
                        "//www.youtube.com/embed/B8197NUQ0LE"
                ], 
                "tags": [
                        "story", 
                        "prologue"
                ]
        },
        {
                "id": "story",
                "name": "The Anemo Archon",
                "story": "While investigating the dragon, you come across a bard known as Venti who is soothing the dragon's rage with song. He explains that the dragon was formerly known as Dvalin, one of the four winds that the god of wind (the Anemo Archon, Barbatos) entrusted to watch over Mondstadt. From analysing tears shed by the dragon, Venti discovers that Dvalin is slowly degrading and being corrupted by the Abyss Order, hence the rampage. Venti reveals that he himself is the Anemo Archon, Barbatos, and that he wants to help his friend Dvalin. He enlists you to steal a holy lyre from the cathedral catacombs and uses it to purify the tears Dvalin sheds. The Abyss Order intervenes and Dvalin retreats to ruins to the North of Mondstadt known as Stormterror's Lair. These are the ruins of Old Mondstadt, during a time that the Anemo Archon ruled over the city as a tyrant, and Venti seems a little upset about these memories so asks you to go and save Dvalin for him. The Traveler succeeds in first defeating and then saving Dvalin, who shakes off the Abyss Order's control and chooses to return to a life of being free as one of the four winds. At the same time this was happening, Mondstadt was under a co-ordinated attack from a bunch of Hilichurls also controlled by the Abyss Order. Kaeya discovers the Order is acting under a single leader, who remains mysteriously un-named. More on that to come. Disaster averted, the gang including Venti head back to the cathedral to replace the holy lyre they stole. They return it, and while making their escape before anyone realized they broke the lyre, Venti is attacked by a Fatui Harbinger (one of the 11 elite commanders of Snezhnaya's military spy network) called Signora. Signora reaches into Venti's chest and pulls out something resembling a chess piece, called a Gnosis. This is the source of an Archon's power, and it appears the Tsaritsa (queen) of Snezhnaya, the Cryo Archon, is after all seven of them for no-doubt-nefarious ends. Venti later explains that a catastrophe 500 years in the past severed the already weak ties between the seven Archons, and since then there has been an uneasy truce between them. The Tsaritsa is clearly breaking that truce now, and we should go and seek the other Archons to find out more about this. And also keep looking for our sibling, can't forget that.",
                "videos": [
                        "//www.youtube.com/embed/DbwipMLxZ48",
                        "//www.youtube.com/embed/S_V0TX6MyGw"
                ],
                "tags": [
                        "story", 
                        "monstadt",
                        "traveler",
                        "venti"
                ]
        },
        {
                "id": "story",
                "name": "The Geo Archon",
                "story": "The next Archon we meet is the lord of Geo: Rex Lapis, or elsewhere known as Morax. He is associated with the region of Liyue and the region's focus on contracts and economy is a result of him overseeing all deals. Like a patron saint of lawyers. Arriving in the harbor city of Liyue, the Traveler learns that the annual Rite of Descension is about to begin, which summons Rex Lapis down to guide the city on how to conduct their affairs in the coming year. The Traveler attends the Rite but instead of summoning down an Archon for a business prediction, a dead dragon falls out of the sky. The Traveler, being one of the few foreign faces in the crowd at the Rite, is accused of having something to do with the death of their god and flees with the help of a Snezhnayan man named Tartaglia. Or Childe. It's really not clear what his name is. We'll go with Childe. Childe outs himself as another of the 11 Fatui Harbingers, but constantly acts aloof, so it's hard for the Traveler to get a handle on what he's up to. Childe offers the only plan of action they can think of, which is to appeal to the demi-gods of the Liyue region for help in clearing their name (and also inform them that their sort-of-dad just got murdered). These demi-gods, the Adepti, seem real mad about Rex Lapis being killed and ask you to help finding the culprit. When we return to Liyue harbor, Childe says the ruling party of the city, the Qixing, have taken Rex Lapis' body and hidden it, not allowing anyone to get near it. After finding out our task of meeting the Seven Archons, he says he will help us see Rex Lapis, even if it's just his corpse. He puts us in touch with a man named Zhongli, who works at the Wangsheng Funeral Parlor and is putting together the ceremony to give Rex Lapis a proper send off. The Traveler heads off on a bunch of errands to learn more about the region and Rex Lapis, by gathering important items for the funeral. While gathering these items, Childe helps procure a stick of incredibly expensive incense and learns from one of his spies where they are keeping the body of Rex Lapis. Having completed the preparations for the funeral, the Traveler is invited to meet with Ningguang, the de facto leader of the Qixing, in her floating palace above the city: The Jade Chamber. After some amusing side blunders involving a ballista and getting a gift for the host, the Traveler and Paimon visit Ningguang in her floating sky palace and find out that the Fatui are making moves all over Teyvat, not just in Mondstadt. Upon returning to Liyue harbor, we find it in chaos as open warfare has broken out between the city and the Fatui. Childe uses the commotion to sneak away and find the place they are keeping Rex Lapis' body, the Golden House (it's a big Scrooge McDuck vault full of coins where all the Mora in the world comes from). Childe reaches into Rex Lapis' body to find his Gnosis but it isn't there, and assumes it's because we've taken it first. The Traveler fights Childe, who is forced to use a powerful item called a Delusion to enable his Foul Legacy Transformation which makes him more powerful and gives him a cool cape. He still gets beaten. After being beaten, Childe summons an ancient sea monster that has been pinned to the seabed beyond Liyue harbor for centuries by stone spears thrown by Rex Lapis during The Archon War. The sea monster, Osial, is real mad about it. The Qixing, the Adepti and the Traveler all band together to defend Liyue harbor from the beast, eventually having to drop the Jade Chamber on top of it like a dang nuke. Might be the most hype bit of the game so far, let's watch it again. Excitement over, they get round to having a funeral for Rex Lapis, despite it being clear it isn't actually the Archon himself as it's missing a Gnosis. To find out what happened to the Geo Archon, we look for Zhongli and find him having a chat with Signora and Childe. Apparently he's the Geo Archon and had orchestrated the entire affair with Signora to test Liyue to find out if they were ready to live without a god watching over them. Defending themselves from Osial with the help of the Adepti convinces him, and as part of a mysterious contract he had made with the Tsaritsa, he hands over his Gnosis. Just like that. Right, we're two Archons down and no closer to finding our sibling. Zhongli tells us about the Electro Archon, Baal, who is currently keeping Inazuma under lock and key because they don't like people having Visions. Might be a bit difficult to get there but off we go.",
                "videos": [
                        "//www.youtube.com/embed/J1aME60sogE",
                        "//www.youtube.com/embed/Wv-Tr-sSoCs"
                ],
                "tags": [
                        "story", 
                        "liyue",
                        "traveler",
                        "zhongli"
                ]
        },
        {
                "id": "story",
                "name": "Off to Inazuma",
                "story": "While looking for a way to get to Inazuma, the Traveler comes across a mysteriously dressed man called Dainsleif. His clothes look a bit like Paimon's cape, very starry. He agrees to go on a commission with the Traveler to investigate some Treasure Hoarders who are trying to steal from an Abyss Order hideout. After getting into the hideout, they find the leader of the Teasure Hoarders dead, kneeling in front of a Statue of the Seven suspended upside down by chains near a dark ball of energy. Creepy. They escape to tell Dainsleif about it, who suspects it is to do with the Abyss Order. He then tells the Traveler about an ancient fallen nation called Khaenri'ah, which fell a few hundred years ago. It was a nation without gods because the humans there were focused on technology. They invented machines that tilled the fields, which now are known as Ruin Guards, as they have gone rogue in the nation's absence. While investigating the Abyss Order, Dainsleif and the Traveler find out that Osial's resurrection was part of their plans, and they are now hoping to attach one of Osial's limbs to the upside-down statue and use part of the first field tilling robot to make some sort of mechanical god. While seeking information on the Field Tiller's whereabouts, they find the Abyss Order attempting to corrupt Boreas, the Wolf Warrior in Wolvendom. They stop the attempt and Boreas informs them the first Field Tiller is in the old Mondstadt ruins, where they recover the part and stop the Abyss Order from using it in their plans. To fully end these plans, Dainsleif suggests the Traveler destroys the upside-down statue in the hideout. When they head in to do that, they are ambushed by Abyss Heralds and your sibling (dun dun duuuuh) who appears to be the mysterious leader of the Abyss Order they are referring to as \"Princess\". Your sibling and Dainsleif appear to know each other, and they reveal that Dainsleif is the Twilight Sword, one of the royal guards from Khaenri'ah, who failed to protect it from whatever catastrophe destroyed it and has been cursed with immortality. He is forced to watch Khaenri'ah's people become monsters (the Abyss mages all write in Khaenri'an runes). The Traveler attempts to get their sibling to return home with them, but they refuse and say their work isn't done with the Abyss Order. They say we will see the truth of the world only after we have completed our journey, and that they will see us at the end. Then they disappear through a portal, which Dainsleif manages to dash through but the Traveler does not. And that's about where we're at. Cryptic clues about some great evil that must be punished, a fallen kingdom from hundreds of years ago, and our sibling appears to be one of our main antagonists! The only way to get more answers is to head to Inazuma and find out what the Electro Archon can tell us about these events!",
                "videos": [
                        "//www.youtube.com/embed/kTeoJLD8U0Y",
                        "//www.youtube.com/embed/-roPvHEg3vU"
                ],
                "tags": [
                        "story", 
                        "inazuma", 
                        "traveler",
                        "raiden shogun"
                ]
        }
]